Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum
Defines the analysis load types.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.NOT_DEFINED
The analysis load type is not defined.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_NODAL_LOAD
The analysis nodal load.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_MEMBER_LINE_LOADX
The analysis member line load in the X direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_MEMBER_LINE_LOADY
The analysis member line load in the Y direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_MEMBER_LINE_LOADZ
The analysis member line load in the Z direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_MEMBER_LINE_MOMENTX
The analysis member line moment load in the X direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_MEMBER_LINE_MOMENTY
The analysis member line moment load in the Y direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_MEMBER_LINE_MOMENTZ
The analysis member line moment load in the Z direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_MEMBER_POINT_LOADX
The analysis member point load in the X direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_MEMBER_POINT_LOADY
The analysis member point load in the Y direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_MEMBER_POINT_LOADZ
The analysis member point load in the Z direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_MEMBER_POINT_MOMENTX
The analysis member point moment load in the X direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_MEMBER_POINT_MOMENTY
The analysis member point moment load in the Y direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_MEMBER_POINT_MOMENTZ
The analysis member point moment load in the Z direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_MEMBER_TEMPERATURE_LOAD
The analysis member temperature load.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_PLATE_POINT_LOAD
The analysis area point load.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_PLATE_LINE_LOAD
The analysis area line load.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_PLATE_PRESSURE_LOAD
The analysis area pressure load.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_BAR_LINE_LOADX
The analysis bar line load in the X direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_BAR_LINE_LOADY
The analysis bar line load in the Y direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_BAR_LINE_LOADZ
The analysis bar line load in the Z direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_BAR_LINE_MOMENTX
The analysis bar line moment load in the X direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_BAR_LINE_MOMENTY
The analysis bar line moment load in the Y direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_BAR_LINE_MOMENTZ
The analysis bar line moment load in the Z direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_BAR_POINT_LOADX
The analysis bar point load in the X direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_BAR_POINT_LOADY
The analysis bar point load in the Y direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_BAR_POINT_LOADZ
The analysis bar point load in the Z direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_BAR_POINT_MOMENTX
The analysis bar point moment load in the X direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_BAR_POINT_MOMENTY
The analysis bar point moment load in the Y direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_BAR_POINT_MOMENTZ
The analysis bar point moment load in the Z direction.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadTypeEnum.ANALYSIS_BAR_TEMPERATURE_LOAD
The analysis bar temperature load.